# По введенным пользователем координатам двух точек вывести
# уравнение прямой, которая проходит через эти точки.

print("Введите координаты двух точек: ")
x1 = float(input("Введите координату x1: "))
y1 = float(input("Введите координату y1: "))
x2 = float(input("Введите координату x2: "))
y2 = float(input("Введите координату y2: "))

a = (y2 - y1) / (x2 - x1)
b = (x2 * y1 - x1 * y2) / (x2 - x1)

if a == 0:
    print('y = ', b)
else:
    if b < 0:
        print('y = ', a, '*x ', b)
    elif b > 0:
        print('y = ', a, '*x +', b)
    else:
        print('y = ', a, '*x ')
