# Поработайте с переменными, создайте несколько, выведите на экран.
# Запросите у пользователя некоторые числа и строки и сохраните в переменные, затем выведите на экран.

print("Приветствую! Вы запустили калькулятор!")

a = int(input("Введите первое число:"))
b = int(input("Введите второе число:"))

sum = a + b
print("Сумма ваших двух чисел", sum)

dif = a - b
print("Разность ваших двух чисел", dif)

mult = a * b
print("Произведение ваших двух чисел", mult)

div = a / b
print("Результат деления ваших двух чисел", div)

